aaron-bond.better-comments
charliermarsh.ruff
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
cstrap.python-snippets
davidanson.vscode-markdownlint
donjayamanne.githistory
eamodio.gitlens
ecmel.vscode-html-css
formulahendry.code-runner
gruntfuggly.todo-tree
jdinhlife.gruvbox
jonathanharty.gruvbox-material-icon-theme
kevinrose.vsc-python-indent
mgesbert.python-path
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
njpwerner.autodocstring
sidthesloth.html5-boilerplate
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tushortz.python-extended-snippets
usernamehw.errorlens
yzhang.markdown-all-in-one
zignd.html-css-class-completion
